; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	thermograph2 - mode
	infrared3 - mode
	infrared4 - mode
	spectrograph5 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star5 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared4)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite1 Phenomenon9)
	(have_image Planet7 infrared4)
	(have_image Phenomenon8 infrared4)
	(have_image Phenomenon9 spectrograph5)
	(have_image Phenomenon10 infrared4)
	(have_image Phenomenon10 thermograph2)
	(have_image Planet11 infrared4)
))

)

; plan
1. (turn_to satellite1 groundstation6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon8 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 7
5. (take_image satellite1 phenomenon8 instrument3 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon10 instrument3 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon10 instrument3 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 3 of 7
9. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 7
10. (take_image satellite1 planet11 instrument3 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 4 of 7
11. (turn_to satellite1 planet7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet7)
   goals met: 4 of 7
12. (take_image satellite1 planet7 instrument3 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 5 of 7
13. (turn_to satellite1 phenomenon9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 7
14. (take_image satellite1 phenomenon9 instrument3 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 7 of 7
